; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v5 ?v10)
             (pred_10 ?v7 ?v6)
             (pred_8 ?v5 ?v6)
             (pred_5 ?v11 ?v5 )
	     (pred_12 ?v5)
             (pred_6 ?v1)
             (pred_9 ?v7)
             (pred_11 ?v6)
             (pred_1 ?v5)
             (pred_2 ?v7)
             (pred_3 ?v5)
             (pred_7 ))



(:action op_1
:parameters (?v3 ?v13 ?v2 ?v8)
:precondition (and (pred_6 ?v3) (pred_6 ?v13) (pred_9 ?v2) (pred_11 ?v8)
          (pred_4 ?v3 ?v13) (pred_10 ?v2 ?v8)
                   (pred_8 ?v13 ?v8) (pred_12 ?v3) 
                   (pred_1 ?v13) (pred_2 ?v2))
:effect (and  (pred_3 ?v13) (not (pred_1 ?v13))))


(:action op_2
:parameters (?v3 ?v9)
:precondition (and (pred_6 ?v3) (pred_6 ?v9)
               (pred_12 ?v3) (pred_4 ?v3 ?v9) (pred_3 ?v9))
:effect (and (pred_12 ?v9) (not (pred_12 ?v3))))

(:action op_4
:parameters (?v3 ?v2)
:precondition (and (pred_6 ?v3) (pred_9 ?v2) 
                  (pred_12 ?v3) (pred_5 ?v2 ?v3) (pred_7 ))
:effect (and (pred_2 ?v2)
   (not (pred_5 ?v2 ?v3)) (not (pred_7 ))))


(:action op_3
:parameters (?v3 ?v4 ?v12)
:precondition (and (pred_6 ?v3) (pred_9 ?v4) (pred_9 ?v12)
                  (pred_12 ?v3) (pred_2 ?v12) (pred_5 ?v4 ?v3))
:effect (and (pred_2 ?v4) (pred_5 ?v12 ?v3)
        (not (pred_2 ?v12)) (not (pred_5 ?v4 ?v3))))

(:action op_5
:parameters (?v3 ?v2)
:precondition (and (pred_6 ?v3) (pred_9 ?v2) 
                  (pred_12 ?v3) (pred_2 ?v2))
:effect (and (pred_7 ) (pred_5 ?v2 ?v3) (not (pred_2 ?v2)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_08 obj_19 obj_02 obj_12 obj_15 obj_01 obj_10 obj_18 obj_16 obj_05 obj_17 obj_09 obj_07 obj_20 obj_03 obj_11
    obj_04 obj_14
    obj_06 obj_13
    )

    (:init
       (pred_7)

       (pred_6 obj_08)
       (pred_6 obj_19)
       (pred_6 obj_02)
       (pred_6 obj_12)
       (pred_6 obj_15)
       (pred_6 obj_01)
       (pred_6 obj_10)
       (pred_6 obj_18)
       (pred_6 obj_16)
       (pred_6 obj_05)
       (pred_6 obj_17)
       (pred_6 obj_09)
       (pred_6 obj_07)
       (pred_6 obj_20)
       (pred_6 obj_03)
       (pred_6 obj_11)
       (pred_11 obj_04)
       (pred_11 obj_14)
       (pred_9 obj_06)
       (pred_9 obj_13)

       (pred_4 obj_08 obj_15)
       (pred_4 obj_08 obj_19)
       (pred_4 obj_19 obj_01)
       (pred_4 obj_19 obj_02)
       (pred_4 obj_19 obj_08)
       (pred_4 obj_02 obj_10)
       (pred_4 obj_02 obj_12)
       (pred_4 obj_02 obj_19)
       (pred_4 obj_12 obj_18)
       (pred_4 obj_12 obj_02)
       (pred_4 obj_15 obj_16)
       (pred_4 obj_15 obj_01)
       (pred_4 obj_15 obj_08)
       (pred_4 obj_01 obj_05)
       (pred_4 obj_01 obj_10)
       (pred_4 obj_01 obj_19)
       (pred_4 obj_01 obj_15)
       (pred_4 obj_10 obj_17)
       (pred_4 obj_10 obj_18)
       (pred_4 obj_10 obj_02)
       (pred_4 obj_10 obj_01)
       (pred_4 obj_18 obj_09)
       (pred_4 obj_18 obj_12)
       (pred_4 obj_18 obj_10)
       (pred_4 obj_16 obj_07)
       (pred_4 obj_16 obj_05)
       (pred_4 obj_16 obj_15)
       (pred_4 obj_05 obj_20)
       (pred_4 obj_05 obj_17)
       (pred_4 obj_05 obj_01)
       (pred_4 obj_05 obj_16)
       (pred_4 obj_17 obj_03)
       (pred_4 obj_17 obj_09)
       (pred_4 obj_17 obj_10)
       (pred_4 obj_17 obj_05)
       (pred_4 obj_09 obj_11)
       (pred_4 obj_09 obj_18)
       (pred_4 obj_09 obj_17)
       (pred_4 obj_07 obj_20)
       (pred_4 obj_07 obj_16)
       (pred_4 obj_20 obj_03)
       (pred_4 obj_20 obj_05)
       (pred_4 obj_20 obj_07)
       (pred_4 obj_03 obj_11)
       (pred_4 obj_03 obj_17)
       (pred_4 obj_03 obj_20)
       (pred_4 obj_11 obj_09)
       (pred_4 obj_11 obj_03)
       (pred_1 obj_11)
       (pred_1 obj_09)
       (pred_8  obj_11 obj_04)
       (pred_8  obj_09 obj_14)
       (pred_3 obj_08)
       (pred_3 obj_19)
       (pred_3 obj_02)
       (pred_3 obj_12)
       (pred_3 obj_15)
       (pred_3 obj_01)
       (pred_3 obj_10)
       (pred_3 obj_18)
       (pred_3 obj_16)
       (pred_3 obj_05)
       (pred_3 obj_17)
       (pred_3 obj_07)
       (pred_3 obj_20)
       (pred_3 obj_03)

       (pred_10  obj_06 obj_04)
       (pred_10  obj_13 obj_14)
       (pred_5 obj_06 obj_15)
       (pred_5 obj_13 obj_12)
       (pred_12 obj_18)
    )

    (:goal (and
       (pred_5 obj_06 obj_05)
    ))
(:constraints
  (always (not (pred_12 obj_01)))
)
)

; plan
1. (op_2 obj_18 obj_10)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_10)
   goals met: 0 of 1
2. (op_2 obj_10 obj_17)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_17)
   goals met: 0 of 1
3. (op_2 obj_17 obj_05)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_05)
   goals met: 0 of 1
4. (op_2 obj_05 obj_16)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_16)
   goals met: 0 of 1
5. (op_2 obj_16 obj_15)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_15)
   goals met: 0 of 1
6. (op_4 obj_15 obj_06)
   deleted: (pred_5 obj_06 obj_15) (pred_7)
   added: (pred_2 obj_06)
   goals met: 0 of 1
7. (op_2 obj_15 obj_16)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_16)
   goals met: 0 of 1
8. (op_2 obj_16 obj_05)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_05)
   goals met: 0 of 1
9. (op_5 obj_05 obj_06)
   deleted: (pred_2 obj_06)
   added: (pred_7) (pred_5 obj_06 obj_05)
   goals met: 1 of 1
